In [1]:
import pandas as pd
import numpy as np
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [2]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [5]:
from numpy import nan as NA

data = pd.Series([1,NA,3.5,NA,7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [6]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])

In [9]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [10]:
data.dropna()  #dropna默认丢弃任何含有缺失值的⾏

     0    1    2
0  1.0  6.5  3.0

In [11]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [12]:
data.dropna(how='all') #传⼊how='all'将只丢弃全为NA的那些⾏

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [13]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
data[4] = NA

In [15]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [16]:
data.dropna(axis=1,how='all')#丢弃列

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [17]:
df = pd.DataFrame(np.random.randn(7,3))

In [18]:
df

          0         1         2
0 -2.171469  1.264776  1.488699
1 -0.519575 -0.174911  0.485337
2 -0.401578  0.021074 -1.258190
3  0.346021 -0.394176 -1.343133
4 -0.736755  0.712747  0.314244
5  0.356735  0.257100  1.438696
6 -1.407043 -1.702800  1.484019

In [19]:
df.iloc[:4,1] = NA

In [20]:
df

          0         1         2
0 -2.171469       NaN  1.488699
1 -0.519575       NaN  0.485337
2 -0.401578       NaN -1.258190
3  0.346021       NaN -1.343133
4 -0.736755  0.712747  0.314244
5  0.356735  0.257100  1.438696
6 -1.407043 -1.702800  1.484019

In [21]:
df.iloc[:2,2] = NA

In [22]:
df

          0         1         2
0 -2.171469       NaN       NaN
1 -0.519575       NaN       NaN
2 -0.401578       NaN -1.258190
3  0.346021       NaN -1.343133
4 -0.736755  0.712747  0.314244
5  0.356735  0.257100  1.438696
6 -1.407043 -1.702800  1.484019

In [23]:
df.dropna()

          0         1         2
4 -0.736755  0.712747  0.314244
5  0.356735  0.257100  1.438696
6 -1.407043 -1.702800  1.484019

In [24]:
df.dropna(thresh=2)#至少有两个不是缺失值

          0         1         2
2 -0.401578       NaN -1.258190
3  0.346021       NaN -1.343133
4 -0.736755  0.712747  0.314244
5  0.356735  0.257100  1.438696
6 -1.407043 -1.702800  1.484019

In [25]:
df.dropna(thresh=3)

          0         1         2
4 -0.736755  0.712747  0.314244
5  0.356735  0.257100  1.438696
6 -1.407043 -1.702800  1.484019

In [26]:
df

          0         1         2
0 -2.171469       NaN       NaN
1 -0.519575       NaN       NaN
2 -0.401578       NaN -1.258190
3  0.346021       NaN -1.343133
4 -0.736755  0.712747  0.314244
5  0.356735  0.257100  1.438696
6 -1.407043 -1.702800  1.484019

In [27]:
df.fillna(0)

          0         1         2
0 -2.171469  0.000000  0.000000
1 -0.519575  0.000000  0.000000
2 -0.401578  0.000000 -1.258190
3  0.346021  0.000000 -1.343133
4 -0.736755  0.712747  0.314244
5  0.356735  0.257100  1.438696
6 -1.407043 -1.702800  1.484019

In [28]:
df.fillna({1:0.5,2:0})

          0         1         2
0 -2.171469  0.500000  0.000000
1 -0.519575  0.500000  0.000000
2 -0.401578  0.500000 -1.258190
3  0.346021  0.500000 -1.343133
4 -0.736755  0.712747  0.314244
5  0.356735  0.257100  1.438696
6 -1.407043 -1.702800  1.484019

In [29]:
_ = df.fillna(0,inplace=True)

In [30]:
df

          0         1         2
0 -2.171469  0.000000  0.000000
1 -0.519575  0.000000  0.000000
2 -0.401578  0.000000 -1.258190
3  0.346021  0.000000 -1.343133
4 -0.736755  0.712747  0.314244
5  0.356735  0.257100  1.438696
6 -1.407043 -1.702800  1.484019

In [31]:
df = pd.DataFrame(np.random.randn(6,3))

In [32]:
df.iloc[2:,1] = NA
df.iloc[4:,2] = NA

In [33]:
df

          0         1         2
0  1.019705 -1.173597  0.240053
1  2.455295 -1.501714  0.266935
2 -0.758528       NaN -0.416907
3  0.682306       NaN  0.159509
4  1.748697       NaN       NaN
5  3.472314       NaN       NaN

In [34]:
df.fillna(method='ffill')#用前面的值来填充  传入method=” “改变插值方式

          0         1         2
0  1.019705 -1.173597  0.240053
1  2.455295 -1.501714  0.266935
2 -0.758528 -1.501714 -0.416907
3  0.682306 -1.501714  0.159509
4  1.748697 -1.501714  0.159509
5  3.472314 -1.501714  0.159509

In [35]:
data = pd.Series([1.,NA,3.5,NA,7])

In [36]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [37]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [38]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})

In [39]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [40]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [41]:
data.drop_duplicates

<bound method DataFrame.drop_duplicates of     k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4>

In [42]:
data['v1'] = range(7)

In [43]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [44]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [45]:
data.columns

Index(['k1', 'k2', 'v1'], dtype='object')

In [46]:
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [47]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [48]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [49]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [50]:
lowercased = data['food'].str.lower()

In [51]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [52]:
data['animal'] = lowercased.map(meat_to_animal)

In [53]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [54]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [55]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [56]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [57]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [58]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [59]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [60]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [61]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [62]:
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [63]:
import pandas as pd
import numpy as np
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [64]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [65]:
transform = lambda x: x[:4].upper()

In [66]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [67]:
data.index = data.index.map(transform)

In [68]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [69]:
f = 'newyork'[:5]

In [70]:
f

'newyo'

In [71]:
data.rename(index=str.title,columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [72]:
data.rename(index={'Ohio': 'INDIANA'},columns={'three': 'peekaboo'})

      one  two  peekaboo  four
OHIO    0    1         2     3
COLO    4    5         6     7
NEW     8    9        10    11

In [73]:
data.rename(index={'Ohio':'INDIANA'},inplace=True)

In [74]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [75]:
 ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [76]:
bins = [18,25,35,60,100]

In [77]:
cats = pd.cut(ages,bins)

In [78]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [79]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [80]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [81]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [82]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [83]:
 group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [84]:
pd.cut(ages,bins,labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [85]:
data = np.random.rand(20)

In [86]:
data

array([0.29613395, 0.24495242, 0.11337635, 0.2395098 , 0.59550403,
       0.44828722, 0.7941825 , 0.48383162, 0.27804672, 0.50803193,
       0.22689077, 0.14916018, 0.01562031, 0.02124549, 0.2135212 ,
       0.84401407, 0.81397876, 0.02098382, 0.61227552, 0.79563048])

In [87]:
pd.cut(data,4,precision=2)#选项precision=2，限定⼩数只有两位

[(0.22, 0.43], (0.22, 0.43], (0.015, 0.22], (0.22, 0.43], (0.43, 0.64], ..., (0.64, 0.84], (0.64, 0.84], (0.015, 0.22], (0.43, 0.64], (0.64, 0.84]]
Length: 20
Categories (4, interval[float64]): [(0.015, 0.22] < (0.22, 0.43] < (0.43, 0.64] < (0.64, 0.84]]

In [88]:
data = np.random.randn(1000)#正态分布

In [89]:
cats = pd.qcut(data,4)#切成四份

In [90]:
cats

[(-3.179, -0.665], (-0.665, -0.00169], (-3.179, -0.665], (-0.00169, 0.753], (0.753, 3.111], ..., (-0.00169, 0.753], (0.753, 3.111], (-3.179, -0.665], (-0.00169, 0.753], (0.753, 3.111]]
Length: 1000
Categories (4, interval[float64]): [(-3.179, -0.665] < (-0.665, -0.00169] < (-0.00169, 0.753] < (0.753, 3.111]]

In [91]:
pd.value_counts(cats)

(0.753, 3.111]        250
(-0.00169, 0.753]     250
(-0.665, -0.00169]    250
(-3.179, -0.665]      250
dtype: int64

In [92]:
pd.value_counts(pd.qcut(data,[0,0.1,0.5,0.9,1.]))#自定义分位数

(-0.00169, 1.315]     400
(-1.311, -0.00169]    400
(1.315, 3.111]        100
(-3.179, -1.311]      100
dtype: int64

In [93]:
data = pd.DataFrame(np.random.randn(1000,4))

In [94]:
data

            0         1         2         3
0    1.060066  0.256523  0.755734  0.142167
1   -0.417523 -1.173436 -1.381338  0.218029
2   -0.722438  1.066224  0.349187 -0.134957
3    1.606629  0.754311 -1.202571 -1.047420
4    0.437448 -0.429819 -0.572061 -0.288962
5   -0.370244 -0.055302 -0.688748 -0.367608
6   -0.365063  0.046820 -2.068172  2.253825
7   -0.523766  0.003192  0.063092 -0.048932
8   -0.075954  0.211161 -0.077877 -0.094757
9    1.135574  1.165547 -0.554849  0.544969
10   0.906338  0.175439 -1.203929  0.859941
11   1.216182 -1.574830 -0.050312 -0.454532
12  -0.044643  0.336029 -0.110482 -0.379038
13   1.275891 -0.196114 -0.773684  0.051368
14  -1.102036 -0.786662  0.721022 -0.117074
15  -0.212576  0.478553  0.247758 -1.201370
16  -0.079445 -0.332095  0.443190 -0.120883
17  -0.497129 -2.243179 -1.287030  0.821810
18  -0.759995  0.805965  1.127864  0.041707
19  -0.820021  0.097989 -0.446165 -0.830526
20  -0.662622 -0.424276  0.787170 -1.457646
21  -1.472409  0.833300 -0.973682 -0.208760
22  -0.190473  0.786664 -2.398148 -0.610543
23  -0.768904  0.791905 -0.368157  0.604017
24  -2.348548  0.307009 -0.498083 -0.412012
25   0.113598  0.799573  0.032124  0.013453
26  -0.848892 -1.043779 -0.499507  0.159947
27   1.309289  2.144415 -1.415377  0.470576
28   0.245315  1.149577  1.150009 -0.000660
29  -1.027598  0.465517 -1.653417  1.344744
..        ...       ...       ...       ...
970 -0.407860  0.949755 -0.177073  0.545266
971 -0.361220  1.725453  0.949341  0.376183
972  1.213302  0.759220 -0.327034 -2.440848
973 -1.486621 -0.450703 -0.282741  1.065548
974  1.815906  0.240556 -0.755633  0.052889
975  0.362155  1.290936 -1.078024  0.164262
976  1.617677 -0.032848  1.519874  0.967724
977  0.086237 -0.809997 -0.031194 -0.446069
978  0.616725 -0.044398 -0.892926 -0.866452
979 -0.801621  0.484750 -0.232868  0.063574
980 -0.276978  0.488352 -0.510845  0.372639
981 -1.326723 -0.117939  0.170050  0.065674
982 -0.631591 -0.850824 -0.193344  0.656113
983  1.134144  0.606719 -1.185775  1.146427
984 -1.247479  1.320920 -1.328945 -2.117331
985  0.014840  0.794868 -0.320862 -0.230364
986  0.971805  0.322006 -0.763064 -0.875576
987 -0.529125 -0.726491 -0.465518 -0.552028
988 -0.331052 -0.601768  0.999200 -0.243385
989  0.214402 -0.224104  0.087808  0.233956
990  3.032906  1.355741  0.550374  0.028745
991  0.786349  1.118582  0.928563  1.180135
992 -0.121763 -0.709593 -1.238068 -0.623016
993 -0.107124  0.800769  0.095287  1.026185
994 -1.380738 -1.620622  0.534956 -0.773993
995 -0.326775 -0.353214 -1.515495 -1.887985
996  1.831145 -1.841558 -0.151884 -0.123375
997  1.286069 -1.779553  1.032927 -0.121896
998 -1.314351  0.791167  1.679510  0.305164
999 -0.877148  1.192599 -1.418344  0.298970

[1000 rows x 4 columns]

In [95]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.025047     0.083430    -0.030975    -0.017231
std       0.985094     0.977216     0.990115     0.998075
min      -3.026276    -3.182034    -3.741463    -3.286290
25%      -0.639184    -0.565627    -0.689869    -0.653854
50%       0.036604     0.094220    -0.037389    -0.012243
75%       0.646513     0.726716     0.615800     0.604784
max       3.084816     3.181713     3.068830     2.986611

In [96]:
col = data[2]

In [97]:
col

0      0.755734
1     -1.381338
2      0.349187
3     -1.202571
4     -0.572061
5     -0.688748
6     -2.068172
7      0.063092
8     -0.077877
9     -0.554849
10    -1.203929
11    -0.050312
12    -0.110482
13    -0.773684
14     0.721022
15     0.247758
16     0.443190
17    -1.287030
18     1.127864
19    -0.446165
20     0.787170
21    -0.973682
22    -2.398148
23    -0.368157
24    -0.498083
25     0.032124
26    -0.499507
27    -1.415377
28     1.150009
29    -1.653417
         ...
970   -0.177073
971    0.949341
972   -0.327034
973   -0.282741
974   -0.755633
975   -1.078024
976    1.519874
977   -0.031194
978   -0.892926
979   -0.232868
980   -0.510845
981    0.170050
982   -0.193344
983   -1.185775
984   -1.328945
985   -0.320862
986   -0.763064
987   -0.465518
988    0.999200
989    0.087808
990    0.550374
991    0.928563
992   -1.238068
993    0.095287
994    0.534956
995   -1.515495
996   -0.151884
997    1.032927
998    1.679510
999   -1.418344
Name: 2, Length: 1000, dtype: float64

In [98]:
col[np.abs(col) > 3]

69    -3.741463
926   -3.049528
945    3.068830
Name: 2, dtype: float64

In [99]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
59   0.213812 -3.182034  1.005886 -0.401283
69   1.652833  0.756754 -3.741463  0.588335
125  3.084816 -0.264995 -1.254923  0.522550
133 -3.026276 -0.504606  1.069712 -0.363820
244  0.458104  3.181713 -0.008872  1.284690
339  0.843934  1.108542  0.004628 -3.286290
491  3.019822  0.547317  0.903580 -0.505897
844  1.661381 -3.021165 -0.025092  0.184426
868  0.586137  0.521789 -1.347498 -3.004749
926  0.588684 -0.502302 -3.049528 -0.190161
945 -0.657257  0.025538  3.068830  0.928551
990  3.032906  1.355741  0.550374  0.028745

In [100]:
data[np.abs(data)>3] = np.sign(data) * 3

In [101]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.024936     0.083452    -0.030253    -0.016940
std       0.984593     0.975996     0.987244     0.997163
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.639184    -0.565627    -0.689869    -0.653854
50%       0.036604     0.094220    -0.037389    -0.012243
75%       0.646513     0.726716     0.615800     0.604784
max       3.000000     3.000000     3.000000     2.986611

In [102]:
data

            0         1         2         3
0    1.060066  0.256523  0.755734  0.142167
1   -0.417523 -1.173436 -1.381338  0.218029
2   -0.722438  1.066224  0.349187 -0.134957
3    1.606629  0.754311 -1.202571 -1.047420
4    0.437448 -0.429819 -0.572061 -0.288962
5   -0.370244 -0.055302 -0.688748 -0.367608
6   -0.365063  0.046820 -2.068172  2.253825
7   -0.523766  0.003192  0.063092 -0.048932
8   -0.075954  0.211161 -0.077877 -0.094757
9    1.135574  1.165547 -0.554849  0.544969
10   0.906338  0.175439 -1.203929  0.859941
11   1.216182 -1.574830 -0.050312 -0.454532
12  -0.044643  0.336029 -0.110482 -0.379038
13   1.275891 -0.196114 -0.773684  0.051368
14  -1.102036 -0.786662  0.721022 -0.117074
15  -0.212576  0.478553  0.247758 -1.201370
16  -0.079445 -0.332095  0.443190 -0.120883
17  -0.497129 -2.243179 -1.287030  0.821810
18  -0.759995  0.805965  1.127864  0.041707
19  -0.820021  0.097989 -0.446165 -0.830526
20  -0.662622 -0.424276  0.787170 -1.457646
21  -1.472409  0.833300 -0.973682 -0.208760
22  -0.190473  0.786664 -2.398148 -0.610543
23  -0.768904  0.791905 -0.368157  0.604017
24  -2.348548  0.307009 -0.498083 -0.412012
25   0.113598  0.799573  0.032124  0.013453
26  -0.848892 -1.043779 -0.499507  0.159947
27   1.309289  2.144415 -1.415377  0.470576
28   0.245315  1.149577  1.150009 -0.000660
29  -1.027598  0.465517 -1.653417  1.344744
..        ...       ...       ...       ...
970 -0.407860  0.949755 -0.177073  0.545266
971 -0.361220  1.725453  0.949341  0.376183
972  1.213302  0.759220 -0.327034 -2.440848
973 -1.486621 -0.450703 -0.282741  1.065548
974  1.815906  0.240556 -0.755633  0.052889
975  0.362155  1.290936 -1.078024  0.164262
976  1.617677 -0.032848  1.519874  0.967724
977  0.086237 -0.809997 -0.031194 -0.446069
978  0.616725 -0.044398 -0.892926 -0.866452
979 -0.801621  0.484750 -0.232868  0.063574
980 -0.276978  0.488352 -0.510845  0.372639
981 -1.326723 -0.117939  0.170050  0.065674
982 -0.631591 -0.850824 -0.193344  0.656113
983  1.134144  0.606719 -1.185775  1.146427
984 -1.247479  1.320920 -1.328945 -2.117331
985  0.014840  0.794868 -0.320862 -0.230364
986  0.971805  0.322006 -0.763064 -0.875576
987 -0.529125 -0.726491 -0.465518 -0.552028
988 -0.331052 -0.601768  0.999200 -0.243385
989  0.214402 -0.224104  0.087808  0.233956
990  3.000000  1.355741  0.550374  0.028745
991  0.786349  1.118582  0.928563  1.180135
992 -0.121763 -0.709593 -1.238068 -0.623016
993 -0.107124  0.800769  0.095287  1.026185
994 -1.380738 -1.620622  0.534956 -0.773993
995 -0.326775 -0.353214 -1.515495 -1.887985
996  1.831145 -1.841558 -0.151884 -0.123375
997  1.286069 -1.779553  1.032927 -0.121896
998 -1.314351  0.791167  1.679510  0.305164
999 -0.877148  1.192599 -1.418344  0.298970

[1000 rows x 4 columns]

In [103]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0  1.0  1.0
1 -1.0 -1.0 -1.0  1.0
2 -1.0  1.0  1.0 -1.0
3  1.0  1.0 -1.0 -1.0
4  1.0 -1.0 -1.0 -1.0

In [104]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [105]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [106]:
sampler = np.random.permutation(5)

In [107]:
sampler

array([1, 0, 4, 3, 2])

In [108]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [109]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
0   0   1   2   3
4  16  17  18  19
3  12  13  14  15
2   8   9  10  11

In [115]:
df.sample(n=3)

    0   1   2   3
0   0   1   2   3
4  16  17  18  19
3  12  13  14  15

In [116]:
choices = pd.Series([5,7,-1,6,4])

In [112]:
choices

0    5
1    7
2   -1
3    6
4    4
dtype: int64

In [113]:
draws = choices.sample(n=10,replace=True)

In [114]:
draws

4    4
3    6
1    7
4    4
3    6
3    6
3    6
4    4
1    7
3    6
dtype: int64